<?php
class BibleLinksArraysIn {
	public $BookByNameFull = array(
						'буття' 							=> '1',
						'книга буття' 						=> '1',
						
						'вихід' 							=> '2',
						'книга виходу' 						=> '2',
						
						'левіт' 							=> '3',
						'книга левіту' 						=> '3',
						
						'числа'								=> '4',
						'книга чисел'						=> '4',
						
						'второзаконня' 						=> '5',
						'повторення закону' 				=> '5',
						'книга второзаконня' 				=> '5',
						'книга повторення закону' 			=> '5',
						
						'ісус навин' 						=> '6',
						'книга ісуса навина' 				=> '6',
						'книга ісуса сина навина' 			=> '6',
						'книга ісуса'						=> '6',
						
						'книга суддів ізраїльських'	 		=> '7',
						'книга суддів' 						=> '7',
						
						'книга рути' 						=> '8',
						
						'перша книга самуїла' 				=> '9',
						
						'друга книга самуїла' 				=> '10',
						
						'перша книга царів' 				=> '11',
						
						'друга книга царів' 				=> '12',
						
						'перша книга хронік' 				=> '13',
						'перша книга параліпоменон' 		=> '13',
						
						'друга книга хронік'				=> '14',
						'друга книга параліпоменон' 		=> '14',
						
						'книга езри' 						=> '15',
						
						'книга неємії' 						=> '16',
						
						'книга естери' 						=> '17',
						
						'книга йова'						=> '18',
						'книга іова'						=> '18',
						
						'книга псалтир' 					=> '19',
						'книга псалмів' 					=> '19',
						
						'книга приповідок соломона' 		=> '20',
						'книга приповідок' 					=> '20',
						
						'книга еклезіяста' 					=> '21',
						'книга екклезіяста' 				=> '21',
						'книга еклесіаста' 					=> '21',
						'книга екклесіаста' 				=> '21',
						'книга еклезіястова' 				=> '21',
						'книга екклезіястова' 				=> '21',
						'книга проповідника' 				=> '21',
						
						'книга пісні пісень соломона' 		=> '22',
						'книга пісні пісень' 				=> '22',
						'книга пісня пісень соломона' 		=> '22',
						'книга пісня пісень' 				=> '22',
						
						'книга ісаї' 						=> '23',
						'книга пророка ісаї' 				=> '23',
						
						'книга єремії' 						=> '24',
						'книга пророка єремії' 				=> '24',
						
						'плач єремії' 						=> '25',
						'книга плач єремії' 				=> '25',
						
						'книга єзекиїла' 					=> '26',
						'книга єзекиїля' 					=> '26',
						'книга пророка єзекиїла' 			=> '26',
						'книга пророка єзекиїля' 			=> '26',
						
						'книга даниїла' 					=> '27',
						'книга пророка даниїла' 			=> '27',
						
						'книга осії' 						=> '28',
						'книга пророка осії' 				=> '28',
						
						'книга йоіла' 						=> '29',
						'книга йоіля' 						=> '29',
						'книга іоіла' 						=> '29',
						'книга іоіля' 						=> '29',
						'книга пророка йоіла' 				=> '29',
						'книга пророка йоіля' 				=> '29',
						'книга пророка іоіла' 				=> '29',
						'книга пророка іоіля' 				=> '29',
						
						'книга амоса'						=> '30',
						'книга пророка амоса' 				=> '30',
						
						'книга йони' 						=> '32',
						'книга іони' 						=> '32',
						'книга пророка йони' 				=> '32',
						'книга пророка іони' 				=> '32',
						
						'книга міхея' 						=> '33',
						'книга пророка міхея' 				=> '33',
						
						'книга наума' 						=> '34',
						'книга пророка наума' 				=> '34',
						
						'книга авакума' 					=> '35',
						'книга пророка авакума' 			=> '35',
						
						'книга софонії' 					=> '36',
						'книга пророка софонії' 			=> '36',
						
						'книга аггея' 						=> '37',
						'книга ангея' 						=> '37',
						'книга пророка аггея' 				=> '37',
						'книга пророка ангея' 				=> '37',
						
						'книга захарії' 					=> '38',
						'книга пророка захарії' 			=> '38',
						
						'книга малахії' 					=> '39',
						'книга пророка малахії' 			=> '39',
						
						'євангеліє від матея' 				=> '40',
						'євангеліє від матвія' 				=> '40',
						'євангеліє матея' 					=> '40',
						'євангеліє матвія' 					=> '40',
						'євангелія від матея' 				=> '40',
						'євангелія від матвія' 				=> '40',
						'євангелія матея' 					=> '40',
						'євангелія матвія' 					=> '40',
						
						'євангеліє від марка' 				=> '41',
						'євангеліє марка' 					=> '41',
						'євангелія від марка' 				=> '41',
						'євангелія марка' 					=> '41',
						
						'євангеліє від луки' 				=> '42',
						'євангеліє луки' 					=> '42',
						'євангелія від луки' 				=> '42',
						'євангелія луки' 					=> '42',
						
						'євангеліє від івана' 				=> '43',
						'євангеліє івана' 					=> '43',
						'євангелія від івана' 				=> '43',
						'євангелія івана' 					=> '43',
						'євангеліє від йоана' 				=> '43',
						'євангеліє йоана' 					=> '43',
						'євангелія від йоана' 				=> '43',
						'євангелія йоана' 					=> '43',
						
						'книга дій' 						=> '44',
						'книга діянь' 						=> '44',
						'книга дій апостолів' 				=> '44',
						'книга діянь апостолів' 			=> '44',
						'дії апостолів' 					=> '44',
						'діяння апостолів' 					=> '44',
						
						'послання якова' 					=> '59',
						'лист якова' 						=> '59',
						
						'перше послання петра' 				=> '60',
						'перший лист петра' 				=> '60',
						
						'друге послання петра' 				=> '61',
						'другий лист петра' 				=> '61',
						
						'перше послання івана' 				=> '62',
						'перший лист івана' 				=> '62',
						'перше послання йоана' 				=> '62',
						'перший лист йоана' 				=> '62',
						
						'послання до римлян' 				=> '45',
						'послання римлянам' 				=> '45',
						'лист до римлян' 					=> '45',
						'лист римлянам' 					=> '45',
						
						'перше послання до коринфян' 		=> '46',
						'перше послання коринфянам'			=> '46',
						'перший лист до коринфян' 			=> '46',
						'перший лист коринфянам'			=> '46',
						
						'друге послання до коринфян' 		=> '47',
						'друге послання коринфянам' 		=> '47',
						'другий лист до коринфян' 			=> '47',
						'другий лист коринфянам' 			=> '47',
						
						'послання до галатів' 				=> '48',
						'послання галатам' 					=> '48',
						'лист до галатів' 					=> '48',
						'лист галатам' 						=> '48',
						
						'послання до ефесян' 				=> '49',
						'послання ефесянам' 				=> '49',
						'лист до ефесян' 					=> '49',
						'лист ефесянам' 					=> '49',
						
						'послання до филип’ян' 				=> '50',
						'послання до филип&#039;ян' 		=> '50',
						'послання филип’янам' 				=> '50',
						'послання филип&#039;янам' 			=> '50',
						'лист до филип’ян' 					=> '50',
						'лист до филип&#039;ян' 			=> '50',
						'лист филип’янам' 					=> '50',
						'лист филип&#039;янам' 				=> '50',
						
						'послання до колосян' 				=> '51',
						'послання колосянам' 				=> '51',
						'лист до колосян' 					=> '51',
						'лист колосянам' 					=> '51',
						
						'перше послання до солунян' 		=> '52',
						'перше послання солунянам' 			=> '52',
						'перий лист до солунян' 			=> '52',
						'перий лист солунянам' 				=> '52',
						'перше послання до солуннян' 		=> '52',
						'перше послання солуняннам' 		=> '52',
						'перий лист до солуннян' 			=> '52',
						'перий лист солуняннам' 			=> '52',
						
						'друге послання до солунян' 		=> '53',
						'друге послання солунянам' 			=> '53',
						'другий лист до солунян' 			=> '53',
						'другий лист солунянам' 			=> '53',
						'друге послання до солуннян' 		=> '53',
						'друге послання солуняннам' 		=> '53',
						'другий лист до солуннян' 			=> '53',
						'другий лист солуняннам' 			=> '53',
						
						'перше послання до тимотея' 		=> '54',
						'перше послання тимотею' 			=> '54',
						'перший лист до тимотея' 			=> '54',
						'перший лист тимотею' 				=> '54',
						'перше послання до тимофія' 		=> '54',
						'перше послання тимофію' 			=> '54',
						'перший лист до тимофія' 			=> '54',
						'перший лист тимофію' 				=> '54',
						
						'друге послання до тимотея' 		=> '55',
						'друге послання тимотею' 			=> '55',
						'другий лист до тимотея' 			=> '55',
						'другий лист тимотею' 				=> '55',
						'друге послання до тимофія' 		=> '55',
						'друге послання тимофію' 			=> '55',
						'другий лист до тимофія' 			=> '55',
						'другий лист тимофію' 				=> '55',
						
						'послання до тита' 					=> '56',
						'послання титу' 					=> '56',
						'лист до тита'	 					=> '56',
						'лист титу' 						=> '56',
						
						'послання до євреїв' 				=> '58',
						'послання євреям' 					=> '58',
						'лист до євреїв' 					=> '58',
						'лист євреям' 						=> '58',
						'послання до юдеїв' 				=> '58',
						'послання юдеям' 					=> '58',
						'лист до юдеїв' 					=> '58',
						'лист юдеям' 						=> '58',
						
						'об’явлення івана богослова' 		=> '66',
						'об&#039;явлення івана богослова' 	=> '66',
						'об’явлення івана' 					=> '66',
						'об&#039;явлення івана' 			=> '66',
						'апокаліпсис івана богослова' 		=> '66',
						'апокаліпсис івана' 				=> '66',
						'об’явлення йоана богослова' 		=> '66',
						'об&#039;явлення йоана богослова' 	=> '66',
						'об’явлення йоана' 					=> '66',
						'об&#039;явлення йоана' 			=> '66',
						'апокаліпсис йоана богослова' 		=> '66',
						'апокаліпсис йоана' 				=> '66',
						
						'книга авдія' 						=> '31',
						'книга овдія' 						=> '31',
						'книга пророка авдія' 				=> '31',
						'книга пророка овдія' 				=> '31',
						
						'послання до филимона' 				=> '57',
						'послання филимону' 				=> '57',
						'лист до филимона' 					=> '57',
						'лист филимону' 					=> '57',
						
						'друге послання івана' 				=> '63',
						'друге послання йоана' 				=> '63',
						'другий лист івана' 				=> '63',
						'другий лист йоана' 				=> '63',
						
						'третє послання івана' 				=> '64',
						'третє послання йоана' 				=> '64',
						'третій лист івана' 				=> '64',
						'третій лист йоана' 				=> '64',
						
						'послання юди' 						=> '65',
						'лист юди' 							=> '65',
						);
						
	public $BookByNameShortPoint = array(
						'бут'					=> '1',
						'бт'					=> '1',
						
						'вих' 					=> '2',
						
						'лев' 					=> '3',
						'лв' 					=> '3',
						
						'числ'					=> '4',
						'чис'					=> '4',
						'чс'					=> '4',
						
						'втор'					=> '5',
						'вт' 					=> '5',
						'втрзк' 				=> '5',
						'повт' 					=> '5',
						
						'iс нав'	 			=> '6',
						'iс&nbsp;нав'	 		=> '6',
						'iс.нав' 				=> '6',
						'iс. нав' 				=> '6',
						'iс.&nbsp;нав' 			=> '6',
						'нав' 					=> '6',
						
						'сд' 					=> '7',
						'суд' 					=> '7',
						
						'рт' 					=> '8',
						
						'1 сам' 				=> '9',
						'1&nbsp;сам' 			=> '9',
						'1сам' 					=> '9',
						
						'2 сам' 				=> '10',
						'2&nbsp;сам' 			=> '10',
						'2сам' 					=> '10',
						
						'1 цар' 				=> '11',
						'1&nbsp;цар' 			=> '11',
						'1цар' 					=> '11',
						'1цр' 					=> '11',
						
						'2 цар' 				=> '12',
						'2&nbsp;цар' 			=> '12',
						'2цар' 					=> '12',
						'2цр' 					=> '12',
						
						'1 пар' 				=> '13',
						'1&nbsp;пар' 			=> '13',
						'1пар' 					=> '13',
						'1 хрон' 				=> '13',
						'1&nbsp;хрон' 			=> '13',
						'1хрон' 				=> '13',
						'1хр' 					=> '13',
						
						'2 пар' 				=> '14',
						'2&nbsp;пар' 			=> '14',
						'2пар' 					=> '14',
						'2 хрон' 				=> '14',
						'2&nbsp;хрон' 			=> '14',
						'2хрон' 				=> '14',
						'2хр' 					=> '14',
						
						'ез' 					=> '15',
						'езр' 					=> '15',
						
						'неєм' 					=> '16',
						'нм' 					=> '16',
						
						'ест' 					=> '17',
						'ес' 					=> '17',
						
						'йв' 					=> '18',
						
						'пс' 					=> '19',
						'псал' 					=> '19',
						'псл' 					=> '19',
						'псалт' 				=> '19',
						
						'пр' 					=> '20',
						'прип' 					=> '20',
						
						'екл' 					=> '21',
						'еккл' 					=> '21',
						
						'пісн' 					=> '22',
						'піс' 					=> '22',
						'псн' 					=> '22',
						
						'іс' 					=> '23',
						'иса' 					=> '23',
						
						'єр' 					=> '24',
						
						'плач' 					=> '25',
						'пл' 					=> '25',
						'плч' 					=> '25',
						'пл. єр' 				=> '25',
						'пл.&nbsp;єр' 			=> '25',
						'пл.єр' 				=> '25',
						
						'єз' 					=> '26',
						
						'дн' 					=> '27',
						'дан' 					=> '27',
						'днл' 					=> '27',
						
						'ос' 					=> '28',
						
						'йоіл' 					=> '29',
						'йл' 					=> '29',
						'іоіл' 					=> '29',
						'іл' 					=> '29',
						
						'ам' 					=> '30',
						'амс' 					=> '30',
						
						'мх' 					=> '33',
						'міх' 					=> '33',
						
						'ав' 					=> '35',
						'авв' 					=> '35',
						'авак' 					=> '35',
						
						'соф' 					=> '36',
						'сф' 					=> '36',
						'софон' 				=> '36',
						
						'аг' 					=> '37',
						'агг' 					=> '37',
						'анг' 					=> '37',
						
						'зах' 					=> '38',
						'зхр' 					=> '38',
						'захар' 				=> '38',
						
						'мал' 					=> '39',
						'мл' 					=> '39',
						'млх' 					=> '39',
						'малах' 				=> '39',
						
						'мт' 					=> '40',
						'мат' 					=> '40',
						'мтв' 					=> '40',
						'матв' 					=> '40',
						
						'мк' 					=> '41',
						'мар' 					=> '41',
						'мр' 					=> '41',
						'мрк' 					=> '41',
						
						'лк' 					=> '42',
						'лук' 					=> '42',
						
						'ів' 					=> '43',
						
						'ді' 					=> '44',
						'д.а' 					=> '44',
						
						'як' 					=> '59',
						
						'1 пет' 				=> '60',
						'1&nbsp;пет' 			=> '60',
						'1пет' 					=> '60',
						'1 пт' 					=> '60',
						'1&nbsp;пт' 			=> '60',
						'1пт' 					=> '60',
						'1 птр' 				=> '60',
						'1&nbsp;птр' 			=> '60',
						'1птр' 					=> '60',
						'1 петр' 				=> '60',
						'1&nbsp;петр' 			=> '60',
						'1петр' 				=> '60',
						
						'2 пет' 				=> '61',
						'2&nbsp;пет' 			=> '61',
						'2пет' 					=> '61',
						'2 пт' 					=> '61',
						'2&nbsp;пт' 			=> '61',
						'2пт' 					=> '61',
						'2 птр' 				=> '61',
						'2&nbsp;птр' 			=> '61',
						'2птр' 					=> '61',
						'2 петр' 				=> '61',
						'2&nbsp;петр' 			=> '61',
						'2петр' 				=> '61',
						
						'1 ів' 					=> '62',
						'1&nbsp;ів' 			=> '62',
						'1ів' 					=> '62',
						'1 іван' 				=> '62',
						'1&nbsp;іван' 			=> '62',
						'1іван' 				=> '62',
						'1 йоан' 				=> '62',
						'1&nbsp;йоан' 			=> '62',
						'1йоан' 				=> '62',
						
						'рим' 					=> '45',
						'римл' 					=> '45',
						
						'1 кор' 				=> '46',
						'1&nbsp;кор' 			=> '46',
						'1кор' 					=> '46',
						'1 коринф' 				=> '46',
						'1&nbsp;коринф' 		=> '46',
						'1коринф' 				=> '46',
						
						'2 кор' 				=> '47',
						'2&nbsp;кор' 			=> '47',
						'2кор' 					=> '47',
						'2 коринф' 				=> '47',
						'2&nbsp;коринф' 		=> '47',
						'2коринф' 				=> '47',
						
						'гал' 					=> '48',
						'галат' 				=> '48',
						
						'еф' 					=> '49',
						'ефес' 					=> '49',
						
						'флп' 					=> '50',
						'фил' 					=> '50',
						'филип' 				=> '50',
						
						'кол' 					=> '51',
						'кл' 					=> '51',
						'колос' 				=> '51',
						
						'1 сол' 				=> '52',
						'1&nbsp;сол' 			=> '52',
						'1сол' 					=> '52',
						
						'2 сол' 				=> '53',
						'2&nbsp;сол' 			=> '53',
						'2сол' 					=> '53',
						
						'1 тим' 				=> '54',
						'1&nbsp;тим' 			=> '54',
						'1тим' 					=> '54',
						'1 тимоф' 				=> '54',
						'1&nbsp;тимоф' 			=> '54',
						'1тимоф' 				=> '54',
						
						'2 тим' 				=> '55',
						'2&nbsp;тим' 			=> '55',
						'2тим' 					=> '55',
						'2 тимоф' 				=> '55',
						'2&nbsp;тимоф' 			=> '55',
						'2тимоф' 				=> '55',
						
						'єв' 					=> '58',
						'юд' 					=> '58',
						'євр' 					=> '58',
						
						'об' 					=> '66',
						'апок' 					=> '66',
						
						'авд' 					=> '31',
						'ов' 					=> '31',
						'овд' 					=> '31',
						
						'флм' 					=> '57',
						'филим' 				=> '57',
						
						'2 ів' 					=> '63',
						'2&nbsp;ів' 			=> '63',
						'2ів' 					=> '63',
						'2 іван' 				=> '63',
						'2&nbsp;іван' 			=> '63',
						'2іван' 				=> '63',
						'2 йоан' 				=> '63',
						'2&nbsp;йоан' 			=> '63',
						'2йоан' 				=> '63',
						
						'3 ів' 					=> '64',
						'3&nbsp;ів' 			=> '64',
						'3ів' 					=> '64',
						'3 іван' 				=> '64',
						'3&nbsp;іван' 			=> '64',
						'3іван' 				=> '64',
						'3 йоан' 				=> '64',
						'3&nbsp;йоан' 			=> '64',
						'3йоан' 				=> '64',
						
						'юд' 					=> '65',
						);

	public $BookByNameShort = array(
						'ісус' 					=> '6',
						
						'судді' 				=> '7',
						'суддів' 				=> '7',
						
						'рут' 					=> '8',
						'рути' 					=> '8',
						
						'1 самуїла' 			=> '9',
						'1&nbsp;самуїла' 		=> '9',
						'1самуїла' 				=> '9',
						
						'2 самуїла' 			=> '10',
						'2&nbsp;самуїла' 		=> '10',
						'2самуїла' 				=> '10',
						
						'1 царів' 				=> '11',
						'1&nbsp;царів' 			=> '11',
						'1царів' 				=> '11',
						
						'2 царів' 				=> '12',
						'2&nbsp;царів' 			=> '12',
						'2царів' 				=> '12',
						
						'1 хронік' 				=> '13',
						'1&nbsp;хронік' 		=> '13',
						'1хронік' 				=> '13',
						
						'2 хронік' 				=> '14',
						'2&nbsp;хронік' 		=> '14',
						'2хронік' 				=> '14',
						
						'езра' 					=> '15',
						'езри' 					=> '15',
						
						'неємія' 				=> '16',
						'неємії' 				=> '16',
						
						'естера' 				=> '17',
						'естери' 				=> '17',
						
						'йов' 					=> '18',
						'йова' 					=> '18',
						
						'псалми' 				=> '19',
						'псалтир'				=> '19',
						'псалом' 				=> '19',
						
						'приповідки' 			=> '20',
						'приповідка' 			=> '20',
						
						'еклезіяста' 			=> '21',
						'екклезіяста' 			=> '21',
						'еклесіаста' 			=> '21',
						
						'песні' 				=> '22',
						'пісні пісень' 			=> '22',
						'пісні&nbsp;пісень' 	=> '22',
						'пісн.пісень' 			=> '22',
						'пісн. пісень' 			=> '22',
						'пісн.&nbsp;пісень' 	=> '22',
						
						'ісаї' 					=> '23',
						'ісая' 					=> '23',
						
						'єремія' 				=> '24',
						
						'єремії' 				=> '25',
						
						'єзекиїла' 				=> '26',
						'єзекиїля' 				=> '26',
						
						'даниїл' 				=> '27',
						'даниїла' 				=> '27',
						
						'осія' 					=> '28',
						'осії' 					=> '28',
						
						'йоіла' 				=> '29',
						'йоіля' 				=> '29',
						'іоіла' 				=> '29',
						'іоіля' 				=> '29',
						
						'амос' 					=> '30',
						'амоса' 				=> '30',
						
						'йон' 					=> '32',
						'йона' 					=> '32',
						'йони' 					=> '32',
						'іон' 					=> '32',
						'іона' 					=> '32',
						'іони' 					=> '32',
						
						'міхей' 				=> '33',
						'міхея' 				=> '33',
						
						'наум' 					=> '34',
						'наума' 				=> '34',
						
						'авакум' 				=> '35',
						'авакума' 				=> '35',
						
						'софонія' 				=> '36',
						'софонії' 				=> '36',
						
						'аггей' 				=> '37',
						'ангей' 				=> '37',
						'аггея' 				=> '37',
						'ангея' 				=> '37',
						
						'захарія' 				=> '38',
						'захарії' 				=> '38',
						
						'малахія' 				=> '39',
						'малахії' 				=> '39',
						
						'матей' 				=> '40',
						'матея' 				=> '40',
						'матвій' 				=> '40',
						'матвія' 				=> '40',
						
						'марк' 					=> '41',
						'марка' 				=> '41',
						
						'лука' 					=> '42',
						'луки' 					=> '42',
						
						'іван' 					=> '43',
						'івана' 				=> '43',
						'йоан' 					=> '43',
						'йоана' 				=> '43',
						
						'дії' 					=> '44',
						'дія' 					=> '44',
						'діяння' 				=> '44',
						
						'яков' 					=> '59',
						'якова' 				=> '59',
						
						'1 петра' 				=> '60',
						'1&nbsp;петра' 			=> '60',
						'1петра' 				=> '60',
						
						'2 петра' 				=> '61',
						'2&nbsp;петра' 			=> '61',
						'2петра' 				=> '61',
						
						'1 івана' 				=> '62',
						'1&nbsp;івана' 			=> '62',
						'1івана' 				=> '62',
						'1 йоана' 				=> '62',
						'1&nbsp;йоана' 			=> '62',
						'1йоана' 				=> '62',
						
						'римлянам' 				=> '45',
						'римлян' 				=> '45',
						
						'1 коринфянам' 			=> '46',
						'1&nbsp;коринфянам' 	=> '46',
						'1коринфянам' 			=> '46',
						'1 коринфян' 			=> '46',
						'1&nbsp;коринфян' 		=> '46',
						'1коринфян' 			=> '46',
						'1 коринтянам' 			=> '46',
						'1&nbsp;коринтянам' 	=> '46',
						'1коринтянам' 			=> '46',
						'1 коринтян' 			=> '46',
						'1&nbsp;коринтян' 		=> '46',
						'1коринтян' 			=> '46',
						
						'2 коринфянам' 			=> '47',
						'2&nbsp;коринфянам' 	=> '47',
						'2коринфянам' 			=> '47',
						'2 коринфян' 			=> '47',
						'2&nbsp;коринфян' 		=> '47',
						'2коринфян' 			=> '47',
						'2 коринтянам' 			=> '47',
						'2&nbsp;коринтянам' 	=> '47',
						'2коринтянам' 			=> '47',
						'2 коринтян' 			=> '47',
						'2&nbsp;коринтян' 		=> '47',
						'2коринтян' 			=> '47',
						
						'галатів' 				=> '48',
						'галатам' 				=> '48',
						
						'ефесянам' 				=> '49',
						'ефесян' 				=> '49',
						
						'филип&rsquo;янам' 		=> '50',
						'филип&rsquo;ян' 		=> '50',
						
						'колосянам' 			=> '51',
						'колосян' 				=> '51',
						
						'1 солунянам' 			=> '52',
						'1&nbsp;солунянам' 		=> '52',
						'1солунянам' 			=> '52',
						
						'2 солунянам' 			=> '53',
						'2&nbsp;солунянам' 		=> '53',
						'2солунянам' 			=> '53',
						
						'1 тимофія' 			=> '54',
						'1&nbsp;тимофія' 		=> '54',
						'1тимофія' 				=> '54',
						'1 тимотея' 			=> '54',
						'1&nbsp;тимотея' 		=> '54',
						'1тимотея' 				=> '54',
						
						'2 тимофія' 			=> '55',
						'2&nbsp;тимофія' 		=> '55',
						'2тимофія' 				=> '55',
						'2 тимотея' 			=> '55',
						'2&nbsp;тимотея' 		=> '55',
						'2тимотея' 				=> '55',
						
						'тита' 					=> '56',
						'тит' 					=> '56',
						
						'євреям' 				=> '58',
						'юдеям' 				=> '58',
						
						'об’явлення' 			=> '66',
						'об&#039;явлення' 		=> '66',
						'апокаліпсис'			=> '66',
						
						'авдій' 				=> '31',
						'авдія' 				=> '31',
						'овдій' 				=> '31',
						'овдія' 				=> '31',
						
						'филимона' 				=> '57',
						'филимон' 				=> '57',
						
						
						'2 івана' 				=> '63',
						'2&nbsp;івана' 			=> '63',
						'2івана' 				=> '63',
						'2 йоана' 				=> '63',
						'2&nbsp;йоана' 			=> '63',
						'2йоана' 				=> '63',
						
						'3 івана' 				=> '64',
						'3&nbsp;івана' 			=> '64',
						'3івана' 				=> '64',
						'3 йоана' 				=> '64',
						'3&nbsp;йоана' 			=> '64',
						'3йоана' 				=> '64',
						
						'юда' 					=> '65',
						'юди' 					=> '65',
						);
						
	public $BookByNameRomanPoint = array(
						'i сам' 				=> '9',
						'i&nbsp;сам' 			=> '9',
						'iсам' 					=> '9',
						
						'ii сам' 				=> '10',
						'ii&nbsp;сам' 			=> '10',
						'iiсам' 				=> '10',
						
						'i цар' 				=> '11',
						'i&nbsp;цар' 			=> '11',
						'iцар' 					=> '11',
						'iцр' 					=> '11',
						
						'ii цар' 				=> '12',
						'ii&nbsp;цар' 			=> '12',
						'iiцар' 				=> '12',
						'iiцр' 					=> '12',
						
						'i пар' 				=> '13',
						'i&nbsp;пар' 			=> '13',
						'iпар' 					=> '13',
						'i хрон' 				=> '13',
						'i&nbsp;хрон' 			=> '13',
						'iхрон' 				=> '13',
						'iхр' 					=> '13',
						
						'ii пар' 				=> '14',
						'ii&nbsp;пар' 			=> '14',
						'iiпар' 				=> '14',
						'ii хрон' 				=> '14',
						'ii&nbsp;хрон' 			=> '14',
						'iiхрон' 				=> '14',
						'iiхр' 					=> '14',
						
						'i пет' 				=> '60',
						'i&nbsp;пет' 			=> '60',
						'iпет' 					=> '60',
						'i пт' 					=> '60',
						'i&nbsp;пт' 			=> '60',
						'iпт' 					=> '60',
						'i птр' 				=> '60',
						'i&nbsp;птр' 			=> '60',
						'iптр' 					=> '60',
						'i петр' 				=> '60',
						'i&nbsp;петр' 			=> '60',
						'iпетр' 				=> '60',
												
						'ii пет' 				=> '61',
						'ii&nbsp;пет' 			=> '61',
						'iiпет' 				=> '61',
						'ii пт' 				=> '61',
						'ii&nbsp;пт' 			=> '61',
						'iiпт' 					=> '61',
						'ii птр' 				=> '61',
						'ii&nbsp;птр' 			=> '61',
						'iiптр' 				=> '61',
						'ii петр' 				=> '61',
						'ii&nbsp;петр' 			=> '61',
						'iiпетр' 				=> '61',
						
						'i ів' 					=> '62',
						'i&nbsp;ів' 			=> '62',
						'iів' 					=> '62',
						'i іван' 				=> '62',
						'i&nbsp;іван' 			=> '62',
						'iіван' 				=> '62',
						'i йоан' 				=> '62',
						'i&nbsp;йоан' 			=> '62',
						'iйоан' 				=> '62',
						
						'i кор' 				=> '46',
						'i&nbsp;кор' 			=> '46',
						'iкор' 					=> '46',
						'i коринф' 				=> '46',
						'i&nbsp;коринф' 		=> '46',
						'iкоринф' 				=> '46',
						
						'ii кор' 				=> '47',
						'ii&nbsp;кор' 			=> '47',
						'iiкор' 				=> '47',
						'ii коринф' 			=> '47',
						'ii&nbsp;коринф' 		=> '47',
						'iiкоринф' 				=> '47',
						
						'i сол' 				=> '52',
						'i&nbsp;сол' 			=> '52',
						'iсол' 					=> '52',
						
						'ii сол' 				=> '53',
						'ii&nbsp;сол' 			=> '53',
						'iiсол' 				=> '53',
						
						'i тим' 				=> '54',
						'i&nbsp;тим' 			=> '54',
						'iтим' 					=> '54',
						'i тимоф' 				=> '54',
						'i&nbsp;тимоф' 			=> '54',
						'iтимоф' 				=> '54',
						
						'ii тим' 				=> '55',
						'ii&nbsp;тим' 			=> '55',
						'iiтим' 				=> '55',
						'ii тимоф' 				=> '55',
						'ii&nbsp;тимоф' 		=> '55',
						'iiтимоф' 				=> '55',
						
						'ii ів' 				=> '63',
						'ii&nbsp;ів' 			=> '63',
						'iiів' 					=> '63',
						'ii іван' 				=> '63',
						'ii&nbsp;іван' 			=> '63',
						'iiіван' 				=> '63',
						'ii йоан' 				=> '63',
						'ii&nbsp;йоан' 			=> '63',
						'iiйоан' 				=> '63',
						
						'iii ів' 				=> '64',
						'iii&nbsp;ів' 			=> '64',
						'iiiів' 				=> '64',
						'iii іван' 				=> '64',
						'iii&nbsp;іван' 		=> '64',
						'iiiіван' 				=> '64',
						'iii йоан' 				=> '64',
						'iii&nbsp;йоан' 		=> '64',
						'iiiйоан' 				=> '64',
						);
						
	public $BookByNameRoman = array(
						'i самуїла' 			=> '9',
						'i&nbsp;самуїла' 		=> '9',
						'iсамуїла' 				=> '9',
						
						'ii самуїла' 			=> '10',
						'ii&nbsp;самуїла' 		=> '10',
						'iiсамуїла' 			=> '10',
						
						'i царів' 				=> '11',
						'i&nbsp;царів' 			=> '11',
						'iцарів' 				=> '11',
						
						'ii царів' 				=> '12',
						'ii&nbsp;царів' 		=> '12',
						'iiцарів' 				=> '12',
						
						'i хронік' 				=> '13',
						'i&nbsp;хронік' 		=> '13',
						'iхронік' 				=> '13',
						
						'ii хронік' 			=> '14',
						'ii&nbsp;хронік' 		=> '14',
						'iiхронік' 				=> '14',
						
						'i петра' 				=> '60',
						'i&nbsp;петра' 			=> '60',
						'iпетра' 				=> '60',
						
						'ii петра' 				=> '61',
						'ii&nbsp;петра' 		=> '61',
						'iiпетра' 				=> '61',
						
						'i івана' 				=> '62',
						'i&nbsp;івана' 			=> '62',
						'iівана' 				=> '62',
						'i йоана' 				=> '62',
						'i&nbsp;йоана' 			=> '62',
						'iйоана' 				=> '62',
						
						'i коринфян' 			=> '46',
						'i&nbsp;коринфян' 		=> '46',
						'iкоринфян' 			=> '46',
						
						'ii коринфян' 			=> '47',
						'ii&nbsp;коринфян' 		=> '47',
						'iiкоринфян' 			=> '47',
						
						'i солунянам' 			=> '52',
						'i&nbsp;солунянам' 		=> '52',
						'iсолунянам' 			=> '52',
						
						'ii солунянам' 			=> '53',
						'ii&nbsp;солунянам' 	=> '53',
						'iiсолунянам' 			=> '53',
						
						'i тимофія' 			=> '54',
						'i&nbsp;тимофія' 		=> '54',
						'iтимофія' 				=> '54',
						'i тимотея' 			=> '54',
						'i&nbsp;тимотея' 		=> '54',
						'iтимотея' 				=> '54',
						
						'ii тимофія' 			=> '55',
						'ii&nbsp;тимофія' 		=> '55',
						'iiтимофія' 			=> '55',
						'ii тимотея' 			=> '55',
						'ii&nbsp;тимотея' 		=> '55',
						'iiтимотея' 			=> '55',
						
						'ii івана' 				=> '63',
						'ii&nbsp;івана' 		=> '63',
						'iiівана' 				=> '63',
						'ii йоана' 				=> '63',
						'ii&nbsp;йоана' 		=> '63',
						'iiйоана' 				=> '63',
						
						'iii івана' 			=> '64',
						'iii&nbsp;івана' 		=> '64',
						'iiiівана' 				=> '64',
						'iii йоана' 			=> '64',
						'iii&nbsp;йоана' 		=> '64',
						'iiiйоана' 				=> '64',
						);
	}
?>