<?php
class BibleLinksArraysIn {
	public $BookByNameFull = array(
						'бытие' 							=> '1',
						'книга бытие' 						=> '1',
						
						'исход' 							=> '2',
						'книга исход' 						=> '2',
						
						'левит' 							=> '3',
						'книга левит' 						=> '3',
						
						'числа'								=> '4',
						'книга чисел'						=> '4',
						
						'второзаконие' 						=> '5',
						'книга второзаконие' 				=> '5',
						
						'иисус навин' 						=> '6',
						'книга иисуса навина' 				=> '6',
						'книга иисуса сына навина' 			=> '6',
						'книга иисуса'						=> '6',
						
						'книга судей израилевых'	 		=> '7',
						'книга судей' 						=> '7',
						
						'книга руфь' 						=> '8',
						'книга руфи' 						=> '8',
						
						'первая книга царств' 				=> '9',
						'первая книга самуила' 				=> '9',
						
						'вторая книга царств' 				=> '10',
						'вторая книга самуила' 				=> '10',
						
						'третья книга царств' 				=> '11',
						'первая книга царей' 				=> '11',
						
						'четвертая книга царств' 			=> '12',
						'вторая книга царей' 				=> '12',
						
						'первый паралипоменон' 				=> '13',
						'первая паралипоменон' 				=> '13',
						'первая книга паралипоменон' 		=> '13',
						'первая книга хроник' 				=> '13',
						
						'второй паралипоменон'				=> '14',
						'вторая паралипоменон' 				=> '14',
						'вторая книга паралипоменон' 		=> '14',
						'вторая книга хроник' 				=> '14',
						
						'книга ездры' 						=> '15',
						
						'книга неемии' 						=> '16',
						
						'книга есфирь' 						=> '17',
						
						'книга иова'						=> '18',
						
						'книга псалтырь' 					=> '19',
						'книга псалтирь' 					=> '19',
						'книга псалмов' 					=> '19',
						
						'книга притч соломона' 				=> '20',
						'книга притч' 						=> '20',
						'книга притчей соломона' 			=> '20',
						'книга притчей'						=> '20',
						
						'книга екклесиаста' 				=> '21',
						'книга екклезиаста' 				=> '21',
						'книга экклесиаста' 				=> '21',
						'книга экклезиаста' 				=> '21',
						'книга проповедника' 				=> '21',
						
						'книга песнь песней соломона' 		=> '22',
						'книга песнь песней' 				=> '22',
						
						'книга исайя' 						=> '23',
						'книга исайи' 						=> '23',
						'книга исаии' 						=> '23',
						'книга пророка исайя' 				=> '23',
						'книга пророка исайи' 				=> '23',
						'книга пророка исаии' 				=> '23',
						
						'книга иеремии' 					=> '24',
						'книга пророка иеремии' 			=> '24',
						
						'плач иеремии' 						=> '25',
						'книга плач иеремии' 				=> '25',
						
						'книга иезекииля' 					=> '26',
						'книга пророка иезекииля' 			=> '26',
						
						'книга даниила' 					=> '27',
						'книга пророка даниила' 			=> '27',
						
						'книга осии' 						=> '28',
						'книга пророка осии' 				=> '28',
						
						'книга иоиль' 						=> '29',
						'книга иоиля' 						=> '29',
						'книга пророка иоиль' 				=> '29',
						
						'книга амоса'						=> '30',
						'книга пророка амоса' 				=> '30',
						
						'книга ионы' 						=> '32',
						'книга пророка ионы' 				=> '32',
						
						'книга михея' 						=> '33',
						'книга пророка михея' 				=> '33',
						
						'книга наума' 						=> '34',
						'книга пророка наума' 				=> '34',
						
						'книга аввакума' 					=> '35',
						'книга пророка аввакума' 			=> '35',
						
						'книга софонии' 					=> '36',
						'книга пророка софонии' 			=> '36',
						
						'книга аггея' 						=> '37',
						'книга пророка аггея' 				=> '37',
						
						'книга захарии' 					=> '38',
						'книга пророка захарии' 			=> '38',
						
						'книга малахии' 					=> '39',
						'книга пророка малахии' 			=> '39',
						
						'евангелие по матфею' 				=> '40',
						'евангелие от матфея' 				=> '40',
						'евангелие матфея' 					=> '40',
						
						'евангелие по марку' 				=> '41',
						'евангелия от марка' 				=> '41',
						'евангелия марка' 					=> '41',
						
						'евангелие по луке' 				=> '42',
						'евангелие от луки' 				=> '42',
						'евангелие луки' 					=> '42',
						
						'евангелие по иоанну' 				=> '43',
						'евангелие от иоанна' 				=> '43',
						'евангелие иоанна' 					=> '43',
						
						'книга деяния' 						=> '44',
						'книга деяний' 						=> '44',
						'книга деяний апостолов' 			=> '44',
						'деяния апостолов' 					=> '44',
						'деятельность апостолов' 			=> '44',
						
						'послание иакова' 					=> '59',
						'письмо иакова' 					=> '59',
						
						'первое послание петра' 			=> '60',
						'первое письмо петра' 				=> '60',
						
						'второе послание петра' 			=> '61',
						'второе письмо петра' 				=> '61',
						
						'первое послание иоанна' 			=> '62',
						'первое письмо иоанна' 				=> '62',
						
						'послание римлянам' 				=> '45',
						'послание к римлянам' 				=> '45',
						'письмо римлянам' 					=> '45',
						'письмо к римлянам' 				=> '45',
						
						'первое послание коринфянам' 		=> '46',
						'первое послание к коринфянам'		=> '46',
						'первое письмо коринфянам' 			=> '46',
						'первое письмо к коринфянам'		=> '46',
						
						'второе послание коринфянам' 		=> '47',
						'второе послание к коринфянам' 		=> '47',
						'второе письмо коринфянам' 			=> '47',
						'второе письмо к коринфянам' 		=> '47',
						
						'послание галатам' 					=> '48',
						'послание к галатам' 				=> '48',
						'письмо галатам' 					=> '48',
						'письмо к галатам' 					=> '48',
						
						'послание ефесянам' 				=> '49',
						'послание эфесянам' 				=> '49',
						'послание к ефесянам' 				=> '49',
						'послание к эфесянам' 				=> '49',
						'письмо ефесянам' 					=> '49',
						'письмо эфесянам' 					=> '49',
						'письмо к ефесянам' 				=> '49',
						'письмо к эфесянам' 				=> '49',
						
						'послание филиппийцам' 				=> '50',
						'послание к филиппийцам' 			=> '50',
						'письмо филиппийцам' 				=> '50',
						'письмо к филиппийцам' 				=> '50',
						
						'послание колоссянам' 				=> '51',
						'послание к колоссянам' 			=> '51',
						'письмо колоссянам' 				=> '51',
						'письмо к колоссянам' 				=> '51',
						
						'первое послание фессалоникийцам' 	=> '52',
						'первое послание к фессалоникийцам' => '52',
						'первое письмо фессалоникийцам' 	=> '52',
						'первое письмо к фессалоникийцам' 	=> '52',
						
						'второе послание фессалоникийцам' 	=> '53',
						'второе послание к фессалоникийцам' => '53',
						'второе письмо фессалоникийцам' 	=> '53',
						'второе письмо к фессалоникийцам'	=> '53',
						
						'первое послание тимофею' 			=> '54',
						'первое послание к тимофею' 		=> '54',
						'первое письмо тимофею' 			=> '54',
						'первое письмо к тимофею' 			=> '54',
						
						'второе послание тимофею' 			=> '55',
						'второе послание к тимофею' 		=> '55',
						'второе письмо тимофею' 			=> '55',
						'второе письмо к тимофею' 			=> '55',
						
						'послание титу' 					=> '56',
						'послание к титу' 					=> '56',
						'письмо титу' 						=> '56',
						'письмо к титу' 					=> '56',
						
						'послание евреям' 					=> '58',
						'послание к евреям' 				=> '58',
						'письмо евреям' 					=> '58',
						'письмо к евреям' 					=> '58',
						
						'откровение иоанна богослова' 		=> '66',
						'откровение иоанна' 				=> '66',
						'апокалипс иоанна богослова' 		=> '66',
						'апокалипс иоанна' 					=> '66',
						'апокалипсис иоанна богослова' 		=> '66',
						'апокалипсис иоанна' 				=> '66',
						
						'книга авдия' 						=> '31',
						'книга пророка авдия' 				=> '31',
						
						'послание филимону' 				=> '57',
						'послание к филимону' 				=> '57',
						'письмо филимону' 					=> '57',
						'письмо к филимону' 				=> '57',
						
						'второе послание иоанна' 			=> '63',
						'второе письмо иоанна' 				=> '63',
						
						'третье послание иоанна' 			=> '64',
						'третье письмо иоанна' 				=> '64',
						
						'послание иуды' 					=> '65',
						'письмо иуды' 						=> '65',
						);
		
	public $BookByNameShortPoint = array(
						'быт'					=> '1',
						'бт'					=> '1',
						
						'исх' 					=> '2',
						
						'лев' 					=> '3',
						'лв' 					=> '3',
						
						'числ'					=> '4',
						'чис'					=> '4',
						'чс'					=> '4',
						
						'втор'					=> '5',
						'вт' 					=> '5',
						'втрзк' 				=> '5',
						
						'ис нав'	 			=> '6',
						'ис&nbps;нав'	 		=> '6',
						'ис.нав' 				=> '6',
						'ис. нав' 				=> '6',
						'ис.&nbps;нав' 			=> '6',
						'иис нав' 				=> '6',
						'иис&nbps;нав' 			=> '6',
						'иис.нав'				=> '6',
						'иис. нав'				=> '6',
						'иис.&nbps;нав'			=> '6',
						'нав' 					=> '6',
						
						'сд' 					=> '7',
						'суд' 					=> '7',
						
						'рф' 					=> '8',
						'руф' 					=> '8',
						
						'1 цар' 				=> '9',
						'1&nbsp;цар' 			=> '9',
						'1цар' 					=> '9',
						'1цр'					=> '9',
						'1ц'					=> '9',
						'1 сам' 				=> '9',
						'1&nbsp;сам' 			=> '9',
						'1сам' 					=> '9',
						
						'2 цар' 				=> '10',
						'2&nbsp;цар' 			=> '10',
						'2цар' 					=> '10',
						'2цр' 					=> '10',
						'2ц' 					=> '10',
						'2 сам' 				=> '10',
						'2&nbsp;сам' 			=> '10',
						'2сам' 					=> '10',
						
						'3 цар' 				=> '11',
						'3&nbsp;цар' 			=> '11',
						'3цар' 					=> '11',
						'3цр' 					=> '11',
						'3ц' 					=> '11',
						
						'4 цар' 				=> '12',
						'4&nbsp;цар' 			=> '12',
						'4цар' 					=> '12',
						'4цр' 					=> '12',
						'4ц' 					=> '12',
						
						'1 пар' 				=> '13',
						'1&nbsp;пар' 			=> '13',
						'1пар' 					=> '13',
						'1пр' 					=> '13',
						'1 хрон' 				=> '13',
						'1&nbsp;хрон' 			=> '13',
						'1хрон' 				=> '13',
						'1хр' 					=> '13',
						
						'2 пар' 				=> '14',
						'2&nbsp;пар' 			=> '14',
						'2пар' 					=> '14',
						'2 хрон' 				=> '14',
						'2&nbsp;хрон' 			=> '14',
						'2хрон' 				=> '14',
						'2хр' 					=> '14',
						
						'ездр' 					=> '15',
						'ез' 					=> '15',
						'езд' 					=> '15',
						
						'неем' 					=> '16',
						'нм' 					=> '16',
						
						'есф' 					=> '17',
						'ес' 					=> '17',
						
						'ив' 					=> '18',
						
						'пс' 					=> '19',
						'псал' 					=> '19',
						'псл' 					=> '19',
						'псалт' 				=> '19',
						
						'пр' 					=> '20',
						'прит' 					=> '20',
						'притч' 				=> '20',
						
						'екк' 					=> '21',
						'экк' 					=> '21',
						'ек' 					=> '21',
						'эк' 					=> '21',
						'екл' 					=> '21',
						'экл' 					=> '21',
						'екк' 					=> '21',
						'экк' 					=> '21',
						'еккл' 					=> '21',
						'эккл' 					=> '21',
						
						'песн' 					=> '22',
						'пес' 					=> '22',
						'псн' 					=> '22',
						
						'ис' 					=> '23',
						'иса' 					=> '23',
						
						'иер' 					=> '24',
						'ир' 					=> '24',
						'иерем' 				=> '24',
						
						'плач' 					=> '25',
						'пл' 					=> '25',
						'плч' 					=> '25',
						'пл. иер' 				=> '25',
						'пл.&nbsp;иер' 			=> '25',
						'пл.иер' 				=> '25',
						
						'из' 					=> '26',
						'иез' 					=> '26',
						'иезек' 				=> '26',
						
						'дн' 					=> '27',
						'дан' 					=> '27',
						'днл' 					=> '27',
						
						'ос' 					=> '28',
						
						'иоил' 					=> '29',
						'ил' 					=> '29',
						
						'ам' 					=> '30',
						'амс' 					=> '30',
						
						'ион' 					=> '32',
						
						'мх' 					=> '33',
						'мих' 					=> '33',
						
						'ав' 					=> '35',
						'авв' 					=> '35',
						'аввак' 				=> '35',
						
						'соф' 					=> '36',
						'сф' 					=> '36',
						'софон' 				=> '36',
						
						'аг' 					=> '37',
						'агг' 					=> '37',
						
						'зах' 					=> '38',
						'зхр' 					=> '38',
						'захар' 				=> '38',
						
						'мал' 					=> '39',
						'мл' 					=> '39',
						'млх' 					=> '39',
						'малах' 				=> '39',
						
						'мф' 					=> '40',
						'мат' 					=> '40',
						'мтф' 					=> '40',
						'мт' 					=> '40',
						'матф' 					=> '40',
						
						'мк' 					=> '41',
						'мар' 					=> '41',
						'мр' 					=> '41',
						'мрк' 					=> '41',
						
						'лк' 					=> '42',
						'лук' 					=> '42',
						
						'ин' 					=> '43',
						'иоан' 					=> '43',
						
						'деян' 					=> '44',
						'дея' 					=> '44',
						'д.а' 					=> '44',
						'д. а' 					=> '44',
						'д.&nbsp;а' 			=> '44',
						
						'иак' 					=> '59',
						'ик' 					=> '59',
						
						'1 пет' 				=> '60',
						'1&nbsp;пет' 			=> '60',
						'1пет' 					=> '60',
						'1 пт' 					=> '60',
						'1&nbsp;пт' 			=> '60',
						'1пт' 					=> '60',
						'1 птр' 				=> '60',
						'1&nbsp;птр' 			=> '60',
						'1птр' 					=> '60',
						'1 петр' 				=> '60',
						'1&nbsp;петр' 			=> '60',
						'1петр' 				=> '60',
						
						'2 пет' 				=> '61',
						'2&nbsp;пет' 			=> '61',
						'2пет' 					=> '61',
						'2 пт' 					=> '61',
						'2&nbsp;пт' 			=> '61',
						'2пт' 					=> '61',
						'2 птр' 				=> '61',
						'2&nbsp;птр' 			=> '61',
						'2птр' 					=> '61',
						'2 петр' 				=> '61',
						'2&nbsp;петр' 			=> '61',
						'2петр' 				=> '61',
						
						'1 ин' 					=> '62',
						'1&nbsp;ин' 			=> '62',
						'1ин' 					=> '62',
						'1 иоан' 				=> '62',
						'1&nbsp;иоан' 			=> '62',
						'1иоан' 				=> '62',
						'1 иоанн' 				=> '62',
						'1&nbsp;иоанн' 			=> '62',
						'1иоанн' 				=> '62',
						
						'рим' 					=> '45',
						'римл' 					=> '45',
						
						'1 кор' 				=> '46',
						'1&nbsp;кор' 			=> '46',
						'1кор' 					=> '46',
						'1 коринф' 				=> '46',
						'1&nbsp;коринф' 		=> '46',
						'1коринф' 				=> '46',
						
						'2 кор' 				=> '47',
						'2&nbsp;кор' 			=> '47',
						'2кор' 					=> '47',
						'2 коринф' 				=> '47',
						'2&nbsp;коринф' 		=> '47',
						'2коринф' 				=> '47',
						
						'гал' 					=> '48',
						'галат' 				=> '48',
						
						'еф' 					=> '49',
						'эф' 					=> '49',
						'ефес' 					=> '49',
						'эфес' 					=> '49',
						
						'флп' 					=> '50',
						'фил' 					=> '50',
						'филип' 				=> '50',
						
						'кол' 					=> '51',
						'кл' 					=> '51',
						'колос' 				=> '51',
						
						'1 фес' 				=> '52',
						'1&nbsp;фес' 			=> '52',
						'1фес' 					=> '52',
						'1 фесс' 				=> '52',
						'1&nbsp;фесс' 			=> '52',
						'1фесс' 				=> '52',
						
						'2 фес' 				=> '53',
						'2&nbsp;фес' 			=> '53',
						'2фес' 					=> '53',
						'2 фесс' 				=> '53',
						'2&nbsp;фесс' 			=> '53',
						'2фесс' 				=> '53',
						
						'1 тим' 				=> '54',
						'1&nbsp;тим' 			=> '54',
						'1тим' 					=> '54',
						'1 тимоф' 				=> '54',
						'1&nbsp;тимоф' 			=> '54',
						'1тимоф' 				=> '54',
						
						'2 тим' 				=> '55',
						'2&nbsp;тим' 			=> '55',
						'2тим' 					=> '55',
						'2 тимоф' 				=> '55',
						'2&nbsp;тимоф' 			=> '55',
						'2тимоф' 				=> '55',
						
						'тит' 					=> '56',
						
						'евр' 					=> '58',
						
						'откр' 					=> '66',
						'отк' 					=> '66',
						'откровен' 				=> '66',
						
						'авд' 					=> '31',
						
						'флм' 					=> '57',
						'филим' 				=> '57',
						
						'2 ин' 					=> '63',
						'2&nbsp;ин' 			=> '63',
						'2ин' 					=> '63',
						'2 иоан' 				=> '63',
						'2&nbsp;иоан' 			=> '63',
						'2иоан' 				=> '63',
						'2 иоанн' 				=> '63',
						'2&nbsp;иоанн' 			=> '63',
						'2иоанн' 				=> '63',
						
						'3 ин' 					=> '64',
						'3&nbsp;ин' 			=> '64',
						'3ин' 					=> '64',
						'3 иоан' 				=> '64',
						'3&nbsp;иоан' 			=> '64',
						'3иоан' 				=> '64',
						'3 иоанн' 				=> '64',
						'3&nbsp;иоанн' 			=> '64',
						'3иоанн' 				=> '64',
						
						'иуд' 					=> '65',
						'ид' 					=> '65',
						);
		
	public $BookByNameShort = array(
						'иисус' 				=> '6',
						
						'судьи' 				=> '7',
						'судей' 				=> '7',
						
						'руфь' 					=> '8',
						'руфи' 					=> '8',
						
						'1 царств' 				=> '9',
						'1&nbsp;царств' 		=> '9',
						'1царств' 				=> '9',
						'1 самуила' 			=> '9',
						'1&nbsp;самуила' 		=> '9',
						'1самуила' 				=> '9',
						
						'2 царств' 				=> '10',
						'2&nbsp;царств' 		=> '10',
						'2царств' 				=> '10',
						'2 самуила' 			=> '10',
						'2&nbsp;самуила' 		=> '10',
						'2самуила' 				=> '10',
						
						'3 царств' 				=> '11',
						'3&nbsp;царств' 		=> '11',
						'3царств' 				=> '11',
						'1 царей' 				=> '11',
						'1&nbsp;царей' 			=> '11',
						'1царей' 				=> '11',
						
						'4 царств' 				=> '12',
						'4&nbsp;царств' 		=> '12',
						'4царств' 				=> '12',
						'2 царей' 				=> '12',
						'2&nbsp;царей' 			=> '12',
						'2царей' 				=> '12',
						
						'1 паралипоменон' 		=> '13',
						'1&nbsp;паралипоменон' 	=> '13',
						'1паралипоменон' 		=> '13',
						'1 хроник' 				=> '13',
						'1&nbsp;хроник' 		=> '13',
						'1хроник' 				=> '13',
						
						'2 паралипоменон' 		=> '14',
						'2&nbsp;паралипоменон' 	=> '14',
						'2паралипоменон' 		=> '14',
						'2 хроник' 				=> '14',
						'2&nbsp;хроник' 		=> '14',
						'2хроник' 				=> '14',
						
						'ездра' 				=> '15',
						'ездры' 				=> '15',
						
						'неемия' 				=> '16',
						'неемии' 				=> '16',
						
						'есфирь' 				=> '17',
						'есфири' 				=> '17',
						
						'иов' 					=> '18',
						'иова' 					=> '18',
						
						'псалмы' 				=> '19',
						'псалтирь'				=> '19',
						'псалтырь' 				=> '19',
						'псалом' 				=> '19',
						
						'притчи' 				=> '20',
						'притча' 				=> '20',
						
						'екклесиаст' 			=> '21',
						'екклезиаст' 			=> '21',
						'экклесиаст' 			=> '21',
						'экклезиаст' 			=> '21',
						'екклесиаста' 			=> '21',
						'екклезиаста' 			=> '21',
						'экклесиаста' 			=> '21',
						'экклезиаста' 			=> '21',
						
						'песни' 				=> '22',
						'песнь песней' 			=> '22',
						'песнь&nbsp;песней' 	=> '22',
						'песнь' 				=> '22',
						'песн.песней' 			=> '22',
						'песн. песней' 			=> '22',
						'песн.&nbsp;песней' 	=> '22',
						
						'исайя' 				=> '23',
						'исаия' 				=> '23',
						'исайи' 				=> '23',
						'исаии' 				=> '23',
						
						'иеремия' 				=> '24',
						
						'иеремии' 				=> '25',
						
						'иезекииль' 			=> '26',
						'иезекииля' 			=> '26',
						
						'даниил' 				=> '27',
						'даниила' 				=> '27',
						
						'осия' 					=> '28',
						'осии' 					=> '28',
						
						'иоиль' 				=> '29',
						'иоиля' 				=> '29',
						
						'амос' 					=> '30',
						'амоса' 				=> '30',
						
						'иона' 					=> '32',
						'ионы' 					=> '32',
						
						'михей' 				=> '33',
						'михея' 				=> '33',
						
						'наум' 					=> '34',
						'наума' 				=> '34',
						
						'аввакум' 				=> '35',
						'аввакума' 				=> '35',
					
						'софония' 				=> '36',
						'софонии' 				=> '36',
						
						'аггей' 				=> '37',
						'аггея' 				=> '37',
						
						'захария' 				=> '38',
						'захарии' 				=> '38',
						
						'малахия' 				=> '39',
						'малахии' 				=> '39',
						
						'матфея' 				=> '40',
						'матфей' 				=> '40',
						
						'марк' 					=> '41',
						'марка' 				=> '41',
						
						'лука' 					=> '42',
						'луки' 					=> '42',
						
						'иоанн' 				=> '43',
						'иоанна' 				=> '43',
						
						'деяния' 				=> '44',
						
						'иаков' 				=> '59',
						'иакова' 				=> '59',
						
						'1 петра' 				=> '60',
						'1&nbsp;петра' 			=> '60',
						'1петра' 				=> '60',
						
						'2 петра' 				=> '61',
						'2&nbsp;петра' 			=> '61',
						'2петра' 				=> '61',
						
						'1 иоанна' 				=> '62',
						'1&nbsp;иоанна' 		=> '62',
						'1иоанна' 				=> '62',
						
						'римлянам' 				=> '45',
						
						'1 коринфянам' 			=> '46',
						'1&nbsp;коринфянам' 	=> '46',
						'1коринфянам' 			=> '46',
						
						'2 коринфянам' 			=> '47',
						'2&nbsp;коринфянам' 	=> '47',
						'2коринфянам' 			=> '47',
						
						'галатам' 				=> '48',
						
						'ефесянам' 				=> '49',
						'эфесянам' 				=> '49',
						
						'филиппийцам' 			=> '50',
						
						'колоссянам' 			=> '51',
						
						'1 фессалоникийцам' 	=> '52',
						'1&nbsp;фессалоникийцам' => '52',
						'1фессалоникийцам' 		=> '52',
						
						'2 фессалоникийцам' 	=> '53',
						'2&nbsp;фессалоникийцам' => '53',
						'2фессалоникийцам' 		=> '53',
						
						'1 тимофею' 			=> '54',
						'1&nbsp;тимофею' 		=> '54',
						'1тимофею' 				=> '54',
						'1 тимофея' 			=> '54',
						'1&nbsp;тимофея' 		=> '54',
						'1тимофея' 				=> '54',
						
						'2 тимофею' 			=> '55',
						'2&nbsp;тимофею' 		=> '55',
						'2тимофею' 				=> '55',
						'2 тимофея' 			=> '55',
						'2&nbsp;тимофея' 		=> '55',
						'2тимофея' 				=> '55',
						
						'титу' 					=> '56',
						
						'евреям' 				=> '58',
						
						'откровение' 			=> '66',
						'апокалипс'				=> '66',
						'апокалипсис'			=> '66',
						
						'авдий' 				=> '31',
						'авдия' 				=> '31',
						
						'филимон' 				=> '57',
						'филимону' 				=> '57',
						
						'2 иоанна' 				=> '63',
						'2&nbsp;иоанна' 		=> '63',
						'2иоанна' 				=> '63',
						
						'3 иоанна' 				=> '64',
						'3&nbsp;иоанна' 		=> '64',
						'3иоанна' 				=> '64',
						
						'иуда' 					=> '65',
						'иуды' 					=> '65',
						);
		
	public $BookByNameRomanPoint = array(
						'i цар' 				=> '9',
						'i&nbsp;цар' 			=> '9',
						'iцар' 					=> '9',
						'iцр'					=> '9',
						'iц'					=> '9',
						'i сам' 				=> '9',
						'i&nbsp;сам' 			=> '9',
						'iсам' 					=> '9',
						
						'ii цар' 				=> '10',
						'ii&nbsp;цар' 			=> '10',
						'iiцар' 				=> '10',
						'iiцр' 					=> '10',
						'iiц' 					=> '10',
						'ii сам' 				=> '10',
						'ii&nbsp;сам' 			=> '10',
						'iiсам' 				=> '10',
						
						'iii цар' 				=> '11',
						'iii&nbsp;цар' 			=> '11',
						'iiiцар' 				=> '11',
						'iiiцр' 				=> '11',
						'iiiц' 					=> '11',
						
						'iv цар' 				=> '12',
						'iv&nbsp;цар' 			=> '12',
						'ivцар' 				=> '12',
						'ivцр' 					=> '12',
						'ivц' 					=> '12',
						
						'i пар' 				=> '13',
						'i&nbsp;пар' 			=> '13',
						'iпар' 					=> '13',
						'iпр' 					=> '13',
						'i хрон' 				=> '13',
						'i&nbsp;хрон' 			=> '13',
						'iхрон' 				=> '13',
						'iхр' 					=> '13',
						
						'ii пар' 				=> '14',
						'ii&nbsp;пар' 			=> '14',
						'iiпар' 				=> '14',
						'ii хрон' 				=> '14',
						'ii&nbsp;хрон' 			=> '14',
						'iiхрон' 				=> '14',
						'iiхр' 					=> '14',
						
						'i пет' 				=> '60',
						'i&nbsp;пет' 			=> '60',
						'iпет' 					=> '60',
						'i пт' 					=> '60',
						'i&nbsp;пт' 			=> '60',
						'iпт' 					=> '60',
						'i птр' 				=> '60',
						'i&nbsp;птр' 			=> '60',
						'iптр' 					=> '60',
						'i петр' 				=> '60',
						'i&nbsp;петр' 			=> '60',
						'iпетр' 				=> '60',
						
						'ii пет' 				=> '61',
						'ii&nbsp;пет' 			=> '61',
						'iiпет' 				=> '61',
						'ii пт' 				=> '61',
						'ii&nbsp;пт' 			=> '61',
						'iiпт' 					=> '61',
						'ii птр' 				=> '61',
						'ii&nbsp;птр' 			=> '61',
						'iiптр' 				=> '61',
						'ii петр' 				=> '61',
						'ii&nbsp;петр' 			=> '61',
						'iiпетр' 				=> '61',
						
						'i ин' 					=> '62',
						'i&nbsp;ин' 			=> '62',
						'iин' 					=> '62',
						'i иоан' 				=> '62',
						'i&nbsp;иоан' 			=> '62',
						'iиоан' 				=> '62',
						'i иоанн' 				=> '62',
						'i&nbsp;иоанн' 			=> '62',
						'iиоанн' 				=> '62',
						
						'i кор' 				=> '46',
						'i&nbsp;кор' 			=> '46',
						'iкор' 					=> '46',
						'i коринф' 				=> '46',
						'i&nbsp;коринф' 		=> '46',
						'iкоринф' 				=> '46',
						
						'ii кор' 				=> '47',
						'ii&nbsp;кор' 			=> '47',
						'iiкор' 				=> '47',
						'ii коринф' 			=> '47',
						'ii&nbsp;коринф' 		=> '47',
						'iiкоринф' 				=> '47',
						
						'i фес' 				=> '52',
						'i&nbsp;фес' 			=> '52',
						'iфес' 					=> '52',
						'i фесс' 				=> '52',
						'i&nbsp;фесс' 			=> '52',
						'iфесс' 				=> '52',
						
						'ii фес' 				=> '53',
						'ii&nbsp;фес' 			=> '53',
						'iiфес' 				=> '53',
						'ii фесс' 				=> '53',
						'ii&nbsp;фесс' 			=> '53',
						'iiфесс' 				=> '53',
						
						'i тим' 				=> '54',
						'i&nbsp;тим' 			=> '54',
						'iтим' 					=> '54',
						'i тимоф' 				=> '54',
						'i&nbsp;тимоф' 			=> '54',
						'iтимоф' 				=> '54',
						
						'ii тим' 				=> '55',
						'ii&nbsp;тим' 			=> '55',
						'iiтим' 				=> '55',
						'ii тимоф' 				=> '55',
						'ii&nbsp;тимоф' 		=> '55',
						'iiтимоф' 				=> '55',
						
						'ii ин' 				=> '63',
						'ii&nbsp;ин' 			=> '63',
						'iiин' 					=> '63',
						'ii иоан' 				=> '63',
						'ii&nbsp;иоан' 			=> '63',
						'iiиоан' 				=> '63',
						'ii иоанн' 				=> '63',
						'ii&nbsp;иоанн' 		=> '63',
						'iiиоанн' 				=> '63',
						
						'iii ин' 				=> '64',
						'iii&nbsp;ин' 			=> '64',
						'iiiин' 				=> '64',
						'iii иоан' 				=> '64',
						'iii&nbsp;иоан' 		=> '64',
						'iiiиоан' 				=> '64',
						'iii иоанн' 			=> '64',
						'iii&nbsp;иоанн' 		=> '64',
						'iiiиоанн' 				=> '64',
						);
						
	public $BookByNameRoman = array(
						'i царств' 				=> '9',
						'i&nbsp;царств' 		=> '9',
						'iцарств' 				=> '9',
						'i самуила' 			=> '9',
						'i&nbsp;самуила' 		=> '9',
						'iсамуила' 				=> '9',
						
						'ii царств' 			=> '10',
						'ii&nbsp;царств' 		=> '10',
						'iiцарств' 				=> '10',
						'ii самуила' 			=> '10',
						'ii&nbsp;самуила' 		=> '10',
						'iiсамуила' 			=> '10',
						
						'iii царств' 			=> '11',
						'iii&nbsp;царств' 		=> '11',
						'iiiцарств' 			=> '11',
						'i царей' 				=> '11',
						'i&nbsp;царей' 			=> '11',
						'iцарей' 				=> '11',
						
						'iv царств' 			=> '12',
						'iv&nbsp;царств' 		=> '12',
						'ivцарств' 				=> '12',
						'ii царей' 				=> '12',
						'ii&nbsp;царей' 		=> '12',
						'iiцарей' 				=> '12',
						
						'i паралипоменон' 		=> '13',
						'i&nbsp;паралипоменон' 	=> '13',
						'iпаралипоменон' 		=> '13',
						'i хроник' 				=> '13',
						
						'ii паралипоменон' 		=> '14',
						'ii&nbsp;паралипоменон' => '14',
						'iiпаралипоменон' 		=> '14',
						'ii хроник' 			=> '14',

						'i петра' 				=> '60',
						'i&nbsp;петра' 			=> '60',
						'iпетра' 				=> '60',
						
						'ii петра' 				=> '61',
						'ii&nbsp;петра' 		=> '61',
						'iiпетра' 				=> '61',
						
						'i иоанна' 				=> '62',
						'i&nbsp;иоанна' 		=> '62',
						'iиоанна' 				=> '62',
						
						'i коринфянам' 			=> '46',
						'i&nbsp;коринфянам' 	=> '46',
						'iкоринфянам' 			=> '46',
						
						'ii коринфянам' 		=> '47',
						'ii&nbsp;коринфянам' 	=> '47',
						'iiкоринфянам' 			=> '47',
						
						'i фессалоникийцам' 	=> '52',
						'i&nbsp;фессалоникийцам' => '52',
						'iфессалоникийцам' 		=> '52',
						
						'ii фессалоникийцам' 	=> '53',
						'ii&nbsp;фессалоникийцам' => '53',
						'iiфессалоникийцам' 	=> '53',
						
						'i тимофею' 			=> '54',
						'i&nbsp;тимофею' 		=> '54',
						'iтимофею' 				=> '54',
						'i тимофея' 			=> '54',
						'i&nbsp;тимофея' 		=> '54',
						'iтимофея' 				=> '54',
						
						'ii тимофею' 			=> '55',
						'ii&nbsp;тимофею' 		=> '55',
						'iiтимофею' 			=> '55',
						'ii тимофея' 			=> '55',
						'ii&nbsp;тимофея' 		=> '55',
						'iiтимофея' 			=> '55',
						
						'ii иоанна' 			=> '63',
						'ii&nbsp;иоанна' 		=> '63',
						'iiиоанна' 				=> '63',
						
						'iii иоанна' 			=> '64',
						'iii&nbsp;иоанна' 		=> '64',
						'iiiиоанна' 			=> '64',
						);
	}
?>