Repository: wp-plugins/multipurpose-bible-linker-russian-and-ukrainian
Catalog: lang/wp_multibiblelinker-*.po
Languages: ru_ru, uk_ua

source: Loaded with the default options.
ru_ru: Загружены опции по умолчанию.
uk_ua: Завантажені опції за замовчуванням.

source: Configuration updated.
ru_ru: Конфигурация обновлена.
uk_ua: Конфігурація оновлена.

source: The plugin is designed to highlight the reference to the place of the Bible in Russian, Ukrainian and English.
ru_ru: Плагин предназначен для подсвечивания ссылок на места из Библии на русском, украинском или английском языках.
uk_ua: Плагін призначений для підсвічування посилань на місця з Біблії російською, українською або англійською мовами.

source: Translation sources
ru_ru: Источники переводов
uk_ua: Джерела перекладів

source: The plugin allows you to set the addressing biblical references to various online sources:
ru_ru: Плагин позволяет устанавливать адресацию библейских ссылок на разные онлайн источники:
uk_ua: Плагін дозволяє встановлювати адресацію біблійних посилань на різні онлайн джерела:

source: by default
ru_ru: по умолчанию
uk_ua: за замовчуванням

source: simultaneously
ru_ru: одновременно
uk_ua: одночасно

source: Language
ru_ru: Язык

source: Language incoming text. In this case, the links are searched in the dictionary, and optionally replaced by a standard spelling. By default, the script refers to the standard translation of the Russian language, Ogeenka — for Ukrainian and King James — for English (not all sources of support Ukrainian and English translations, in which case the default link leads to the King James).
ru_ru: Язык входящего текста. В данном случае ссылки ищутся по словарю и по желанию заменяются на стандартное написание. По умолчанию скрипт ссылается на Синодальный перевод для русского языка, Огеенка — для украинского и короля Якова — для английского (не все источники поддерживают украинский и английский переводы, в таком случае ссылка по умолчанию ведет на Синодальный).
uk_ua: Мова вхідного тексту. У даному випадку посилання шукаються за словником і за бажанням замінюються на стандартне написання. За замовчуванням скрипт посилається на Синодальний переклад для російської мови, Огеенка - для українського та короля Якова - для англійської (не всі джерела підтримують українська та англійська переклади, в такому випадку посилання за замовчуванням веде на Синодальний).

source: Standard writing links: eastern (Matt. 3:4-6,8) or western (Matt. 3,4-6.8).
ru_ru: Стандарт написания ссылки: восточный (Мф. 3:4–6,8) или западный (Мф. 3,4–6.8).
uk_ua: Стандарт написання посилання: східний (Мт. 3:4-6,8) або західний (Мт. 3,4-6.8).

source: eastern
ru_ru: восточный
uk_ua: східний

source: western
ru_ru: западный
uk_ua: західний

source: Type of whitespace: non-breaking or thin.
ru_ru: Тип пробела: неразрывный или тонкий.
uk_ua: Тип пробілу: нерозривний або тонкий.

source: non-breaking
ru_ru: неразрывный
uk_ua: нерозривний

source: thin
ru_ru: тонкий
uk_ua: тонкий

source: Processing options
ru_ru: Опции обработки
uk_ua: Опції обробки

source: Numbers of the books and the chapters may be Roman numerals
ru_ru: Номера книг и глав могут быть римскими цифрами
uk_ua: Номери книг і розділів можуть бути римськими цифрами

source: Correct titles on standard
ru_ru: Исправлять названия книг на стандартные
uk_ua: Виправляти назви книг на стандартні

source: Repeat the name of the book before each chapter, if a few heads
ru_ru: Повторять название книги каждый раз перед главой, если глав несколько
uk_ua: Повторювати назву книги кожен раз перед главою, якщо глав кілька

source: Make a link inseparable
ru_ru: Сделать ссылку неразрывной
uk_ua: Зробити посилання нерозривним

source: Pop-up window with the verse from
ru_ru: Включить всплывающее окно со стихом с
uk_ua: Включити виринаюче вікно з віршем з

source: Restore defaults
ru_ru: Восстановить по умолчанию
uk_ua: Відновити за замовчуванням

source: Save
ru_ru: Сохранить
uk_ua: Зберегти
